
#Область СлужебныеПроцедурыИФункции

//
//Параметр:
// СсылкаНаДоговор - СправочникСсылка.ДоговорыКонтрагентов
//Возвращаемое значение
// ВидДоговора - Перечисления.ВидыДоговоровКонтрагентов

Функция ВКМ_ОпределитьВидДоговора(СсылкаНаДоговор) Экспорт
// ++ БелГН ВКМ 20.10.2025
	
	Возврат ВКМ_ОбщиеПроцедурыИФункции.ВКМ_ОпределитьВидДоговора(СсылкаНаДоговор);
	
// --
КонецФункции

//
//Параметр:
// СсылкаНаДоговор - См. ВКМ_ОбщиеПроцедурыИФункции.ВКМ_ПроверкаСозданияДокументаСАбонОплатойВМесяце
// СсылкаНаДокумент - См. ВКМ_ОбщиеПроцедурыИФункции.ВКМ_ПроверкаСозданияДокументаСАбонОплатойВМесяце
//Возвращаемое значение
// Булево

Функция ВКМ_ПроверкаСозданияДокументаСАбонОплатойВМесяце(СсылкаНаДоговор, СсылкаНаДокумент) Экспорт
// ++ БелГН ВКМ 20.10.2025
	
	Возврат ВКМ_ОбщиеПроцедурыИФункции.ВКМ_ПроверкаСозданияДокументаСАбонОплатойВМесяце(СсылкаНаДоговор, СсылкаНаДокумент);
	
// --
КонецФункции

	
#КонецОбласти
