
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

// Определяет общее количество часов и сумму оплаты за период
//
// Параметры:
// 	ПараметрыРасчета - Структура
//		"Договор" - ссылка на Договор
//		"ДатаНачала" - дата начало периода
//		"ДатаОкончания" - дата окончание периода
//		"СуммаРаботСпециалиста" - итоговая сумма за работу в выбранном периоде
//		"КоличествоЧасовРаботыСпециалиста" - итоговое количество часов работы в выбранном периоде 

Процедура СуммуОплатыРаботыСпециалистаЗаПериод(ПараметрыРасчета) Экспорт
	
	Если Не ЗначениеЗаполнено(ПараметрыРасчета) Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВКМ_ВыполненныеКлиентуРаботыОбороты.КоличествоЧасовОборот,
		|	ВКМ_ВыполненныеКлиентуРаботыОбороты.СуммаКОплатеОборот
		|ИЗ
		|	РегистрНакопления.ВКМ_ВыполненныеКлиентуРаботы.Обороты(&ДатаНачала, &ДатаОкончания, Месяц, Договор = &Договор) КАК
		|		ВКМ_ВыполненныеКлиентуРаботыОбороты";
	
	Запрос.УстановитьПараметр("ДатаОкончания", ПараметрыРасчета.ДатаОкончания);
	Запрос.УстановитьПараметр("ДатаНачала", ПараметрыРасчета.ДатаНачала);
	Запрос.УстановитьПараметр("Договор", ПараметрыРасчета.Договор);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		ПараметрыРасчета.КоличествоЧасовРаботыСпециалиста = ВыборкаДетальныеЗаписи.КоличествоЧасовОборот;
		ПараметрыРасчета.СуммаРаботСпециалиста = ВыборкаДетальныеЗаписи.СуммаКОплатеОборот;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли