#Область ПрограммныйИнтерфейс

//Дополняет форму новыми элементами
// Параметры:
//	Форма - см. ПодключаемыеКоманды.ПриСозданииНаСервере
Процедура ДополнитьФорму(Форма) Экспорт
 // ++ БелГН ВКМ 05.10.2025
 	ИмяФормы = Форма.ИмяФормы;            
	
	Если ИмяФормы = "Справочник.ДоговорыКонтрагентов.Форма.ФормаЭлемента" Тогда
		ДобавитьГруппуАбонентскоеОбслуживание(Форма);
	КонецЕсли;
 // --	
КонецПроцедуры
	
#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Процедура ДобавитьГруппуАбонентскоеОбслуживание(Форма) Экспорт
// ++ БелГН ВКМ 05.10.2025
	Группа = Форма.Элементы.Добавить("ГруппаАбонентскоеОбслуживание",Тип("ГруппаФормы"));
	Группа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	Группа.Заголовок = "Условия абонентского обслуживания";
	Группа.ОтображатьЗаголовок = Истина;
	Группа.Поведение = ПоведениеОбычнойГруппы.Свертываемая;
	Группа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	
	ГруппаЛевая = Форма.Элементы.Добавить("ГруппаЛевая",Тип("ГруппаФормы"),Группа);
	ГруппаЛевая.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаЛевая.ОтображатьЗаголовок = Ложь;
	ГруппаЛевая.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	
	ГруппаПравая = Форма.Элементы.Добавить("ГруппаПравая",Тип("ГруппаФормы"),Группа);
	ГруппаПравая.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаПравая.ОтображатьЗаголовок = Ложь;
	ГруппаПравая.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	
	ПолеВвода = Форма.Элементы.Добавить("ВКМ_НачалоДействияДоговора",Тип("ПолеФормы"),ГруппаЛевая);
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.ВКМ_НачалоДействияДоговора";

	ПолеВвода = Форма.Элементы.Добавить("ВКМ_ОкончаниеДействияДоговора",Тип("ПолеФормы"),ГруппаПравая);
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.ВКМ_ОкончаниеДействияДоговора";

	ПолеВвода = Форма.Элементы.Добавить("ВКМ_СуммаАбонентскойПлаты",Тип("ПолеФормы"),ГруппаЛевая);
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.ВКМ_СуммаАбонентскойПлаты";

	ПолеВвода = Форма.Элементы.Добавить("ВКМ_СтоимостьЧасаРаботы",Тип("ПолеФормы"),ГруппаПравая);
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.ВКМ_СтоимостьЧасаРаботы";
// --
КонецПроцедуры
	
#КонецОбласти