#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Ответственный = Пользователи.ТекущийПользователь();
	ВидРасчета = ПланыВидовРасчета.ВКМ_ДополнительныеНачисления.Премия;
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	Движения.ВКМ_ДополнительныеНачисления.Записывать = Истина;
	Движения.ВКМ_Удержания.Записывать = Истина;

	Для Каждого ТекСтрокаСписокСотрудников из СписокСотрудников Цикл
		// регистр ВКМ_ДополнительныеНачисления
		ДвижениеПремия = Движения.ВКМ_ДополнительныеНачисления.Добавить();
		ДвижениеПремия.Сторно = Ложь;
		ДвижениеПремия.ВидРасчета = ВидРасчета;
		ДвижениеПремия.ПериодРегистрации = Дата;
		ДвижениеПремия.Сотрудник = ТекСтрокаСписокСотрудников.Сотрудник;
		ДвижениеПремия.Сумма = ТекСтрокаСписокСотрудников.СуммаПремии;
		ДвижениеПремия.Показатель = ТекСтрокаСписокСотрудников.СуммаПремии;

		// регистр ВКМ_Удержания
		ДвижениеУдержаний = Движения.ВКМ_Удержания.Добавить();
		ДвижениеУдержаний.Сторно = Ложь;
		ДвижениеУдержаний.ВидРасчета = ПланыВидовРасчета.ВКМ_Удержания.НДФЛ;
		ДвижениеУдержаний.ПериодРегистрации = Дата;
		ДвижениеУдержаний.БазовыйПериодНачало = НачалоМесяца(НачалоДня(Дата));
		ДвижениеУдержаний.БазовыйПериодКонец = КонецМесяца(КонецДня(Дата));
		ДвижениеУдержаний.Сотрудник = ТекСтрокаСписокСотрудников.Сотрудник;
		ДвижениеУдержаний.Показатель = 13;
		ДвижениеУдержаний.Сумма = Окр(ДвижениеПремия.Сумма * ДвижениеУдержаний.Показатель / 100, 0, 1);
		
		ТекСтрокаСписокСотрудников.НДФЛ = ДвижениеУдержаний.Сумма;

		// регистр ВКМ_ВзаиморасчетыССотрудниками
		ДвижениеВзаиморасчеты = Движения.ВКМ_ВзаиморасчетыССотрудниками.Добавить();
		ДвижениеВзаиморасчеты.Период = Дата;
		ДвижениеВзаиморасчеты.ВидДвижения = ВидДвиженияНакопления.Приход;
		ДвижениеВзаиморасчеты.Сотрудник = ТекСтрокаСписокСотрудников.Сотрудник;
		ДвижениеВзаиморасчеты.Сумма = ДвижениеПремия.Сумма - ДвижениеУдержаний.Сумма;
	КонецЦикла;

	Движения.ВКМ_ДополнительныеНачисления.Записать();
	Движения.ВКМ_Удержания.Записать();
	Движения.ВКМ_ВзаиморасчетыССотрудниками.Записать();

	Записать();
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	//Данный фрагмент построен конструктором.
	//При повторном использовании конструктора, внесенные вручную данные будут утеряны!

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры

#КонецОбласти

#КонецЕсли
