#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции
//
//Параметры:
// ПараметрыПереноса - Структура

Процедура ИзмененияДанныхВДокументеПриПереносеДатыВремениВКалендаре(ПараметрыПереноса) Экспорт

	Если ТипЗнч(ПараметрыПереноса) = Тип("Структура") Тогда
	
		СсылкаНаДокумент = ПараметрыПереноса.СсылкаНаДокумент; 
		ДокументОбъект = СсылкаНаДокумент.ПолучитьОбъект();
		
		Если ДокументОбъект <> Неопределено Тогда
		
			ЗаполнитьЗначенияСвойств(ДокументОбъект, ПараметрыПереноса);
			
			Если ДокументОбъект.Проведен Тогда
				ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
			Иначе
				ДокументОбъект.Записать(РежимЗаписиДокумента.Запись);
			КонецЕсли;
			
		КонецЕсли;

	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#КонецЕсли
