
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	ЗаполнитьКалендарьНаСервере(НачалоДня(Период.ДатаНачала), КонецДня(Период.ДатаОкончания));

КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	
	ЗаполнитьКалендарьНаСервере(НачалоДня(Период.ДатаНачала), КонецДня(Период.ДатаОкончания));
	
КонецПроцедуры

&НаКлиенте
Процедура КалендарьПриСменеТекущегоПериодаОтображения(Элемент, ТекущиеПериодыОтображения, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ЗаполнитьКалендарьНаСервере(НачалоДня(ТекущиеПериодыОтображения[0].Начало), КонецДня(ТекущиеПериодыОтображения[0].Конец));
	
КонецПроцедуры


&НаКлиенте
Процедура КалендарьПередНачаломБыстрогоРедактирования(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыФормы = Новый Структура("Ключ", Элемент.ВыделенныеЭлементы[0].Значение);
	
	ОткрытьФорму("Документ.ВКМ_ОбслуживаниеКлиентов.Форма.ФормаДокумента", ПараметрыФормы);
	
КонецПроцедуры
#КонецОбласти


#Область ОбработчикиКомандФормы
// Код процедур и функций
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьКалендарьНаСервере(ДатаНачала, ДатаОкончания)

	Если Не ЗначениеЗаполнено(Период) Тогда
		ОбщегоНазначения.СообщитьПользователю("Не выбран период",,Элементы.Период,Период);
		Возврат;
	КонецЕсли;
	
	Календарь.ТекущиеПериодыОтображения.Очистить();
	Календарь.ТекущиеПериодыОтображения.Добавить(ДатаНачала, ДатаОкончания);
	//Календарь.ВыравниватьГраницыЭлементовПоШкалеВремени = Истина;

	ИзмеренияКалендаря = Календарь.Измерения;
	ИзмеренияКалендаря.Очистить();
	
	ИзмерениеСпециалисты = ИзмеренияКалендаря.Добавить("Специалисты");
	
	ЭлементыКалендаря = Календарь.Элементы;
	ЭлементыКалендаря.Очистить();

	
	Запрос = Новый Запрос;
	Запрос.Текст =
	
		"ВЫБРАТЬ
		|	ВКМ_ОбслуживаниеКлиентов.Ссылка КАК Ссылка,
		|	ВКМ_ОбслуживаниеКлиентов.Специалист КАК Специалист,
		|	ВКМ_ОбслуживаниеКлиентов.ДатаПроведенияРабот КАК ДатаПроведенияРабот,
		|	ВКМ_ОбслуживаниеКлиентов.ВремяНачалаРабот КАК ВремяНачалаРабот,
		|	ВКМ_ОбслуживаниеКлиентов.ВремяОкончанияРабот КАК ВремяОкончанияРабот,
		|	ВКМ_ОбслуживаниеКлиентов.Клиент КАК Клиент,
		|	ВКМ_ОбслуживаниеКлиентов.Клиент.Представление КАК КлиентПредставление,
		|	ВКМ_ОбслуживаниеКлиентов.Договор.Представление КАК ДоговорПредставление,
		|	ВКМ_ОбслуживаниеКлиентов.Специалист.Представление КАК СпециалистПредставление,
		|	ВКМ_ОбслуживаниеКлиентов.ОписаниеПроблемы КАК ОписаниеПроблемы
		|ИЗ
		|	Документ.ВКМ_ОбслуживаниеКлиентов КАК ВКМ_ОбслуживаниеКлиентов
		|ГДЕ
		|	ВКМ_ОбслуживаниеКлиентов.ДатаПроведенияРабот МЕЖДУ &ДатаНачала И &ДатаОкончания
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДатаПроведенияРабот,
		|	ВремяНачалаРабот,
		|	Специалист";
	
	Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончания);
	Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		НовыйСпециалист = ИзмерениеСпециалисты.Элементы.Найти(Выборка.Специалист);
		Если НовыйСпециалист = Неопределено Тогда
			НовыйСпециалист = ИзмерениеСпециалисты.Элементы.Добавить(Выборка.Специалист);
			НовыйСпециалист.Текст = Выборка.СпециалистПредставление;
		КонецЕсли;
		
		СоответствиеЗначений = Новый Соответствие;
		СоответствиеЗначений.Вставить("Специалисты", Выборка.Специалист);
		
		РазницаВремениНачало = Выборка.ВремяНачалаРабот - НачалоДня(Выборка.ВремяНачалаРабот);
		РазницаВремениКонец = Выборка.ВремяОкончанияРабот - НачалоДня(Выборка.ВремяОкончанияРабот);
		НачалоДаты = НачалоДня(Выборка.ДатаПроведенияРабот);
		
		ДатаВремяНачало =НачалоДаты + РазницаВремениНачало;
		ДатаВремяОкончание = НачалоДаты + РазницаВремениКонец;
		
		НовыйЭлемент = ЭлементыКалендаря.Добавить(ДатаВремяНачало, ДатаВремяОкончание);
		НовыйЭлемент.ЗначенияИзмерений = Новый ФиксированноеСоответствие(СоответствиеЗначений);
		НовыйЭлемент.Текст = Выборка.Ссылка;
		НовыйЭлемент.Значение = Выборка.Ссылка;
		НовыйЭлемент.ЦветФона = WebЦвета.СветлоЗолотистый;
		
	КонецЦикла;

КонецПроцедуры

#КонецОбласти
