#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Ответственный = Пользователи.ТекущийПользователь();
КонецПроцедуры


Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	Движения.ВКМ_ИспользованиеДнейОтпуска.Записывать = Истина;

	Для Каждого ТекСтрокаОтпускаСотрудников из ОтпускаСотрудников Цикл
		Движение = Движения.ВКМ_ИспользованиеДнейОтпуска.ДобавитьПриход();
		Движение.Период = Дата;
		Движение.Сотрудник = ТекСтрокаОтпускаСотрудников.Сотрудник;
		Движение.Дни = ТекСтрокаОтпускаСотрудников.Дни;
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#КонецЕсли
